In [ ]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

engine = create_engine('postgresql://neondb_owner:npg_51nlumChHGvd@ep-old-bonus-a1zk7wxo-pooler.ap-southeast-1.aws.neon.tech:5432/python_programming?sslmode=require&options=endpoint%3Dep-old-bonus-a1zk7wxo-pooler')


stu = pd.read_sql_table('student', engine)

In [6]:
stu

Empty DataFrame
Columns: [id, name, gender]
Index: []

In [7]:
stu = pd.read_sql_table('student', engine)

In [8]:
stu

   id     name gender
0   1  Sambath      M

In [10]:
stu2 = dict(id=2, name = 'John', gender = 'M')
stu2 = pd.DataFrame([stu2])
stu2

   id  name gender
0   2  John      M

In [15]:
pd.concat([stu, stu2]).to_sql("student", engine, if_exists='append', index=False)

3

In [16]:
stu = pd.read_sql_table('student', engine)
stu

   id     name gender
0   1  Sambath      M
1   2     John      M
2   1  Sambath      M
3   2     John      M
4   2     John      M

In [23]:
pd.concat([stu, stu2]).to_sql("instructor", engine, if_exists='append', index=False)

6

In [24]:

instructor = pd.read_sql_table('instructor', engine)
instructor

   id     name gender
0   1  Sambath      M
1   1  Sambath      M
2   1  Sambath      M
3   2     John      M
4   1  Sambath      M
5   2     John      M
6   2     John      M
7   2     John      M

In [21]:
from sqlalchemy import text
with engine.connect() as con:
    con.execute(text("Delete from instructor where id = 2"))
    con.commit()

In [22]:

instructor = pd.read_sql_table('instructor', engine)
instructor

   id     name gender
0   1  Sambath      M
1   1  Sambath      M

In [25]:
deleting_names = ["John", "Jane", "Jim", "Jill"]

from sqlalchemy import text
with engine.connect() as con:
    con.execute(text("Delete from instructor where name = ANY(:names)"), { "names": deleting_names })
    con.commit()

In [26]:

instructor = pd.read_sql_table('instructor', engine)
instructor

   id     name gender
0   1  Sambath      M
1   1  Sambath      M
2   1  Sambath      M
3   1  Sambath      M